//AADSignIn Password Auth successes the last 90d
SigninLogs 
| where TimeGenerated >= ago(90d)
| where parse_json(AuthenticationDetails)[0].authenticationMethod == "Password"
//| where Identity <> "Excluded Identities"
| where parse_json(AuthenticationDetails)[0].succeeded == true
| extend city_ = tostring(LocationDetails.city)
| extend countryOrRegion_ = tostring(LocationDetails.countryOrRegion)
| extend state_ = tostring(LocationDetails.state)
| project TimeGenerated, SourceSystem, Identity, IPAddress, city_, state_, countryOrRegion_
| sort by TimeGenerated desc
//| summarize count() by Identity
