// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download", "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize
    StartTime = min(TimeGenerated),
    EndTime = max(TimeGenerated),
    NameCount = count()
    by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP
